**** Exercise
#+begin_src C++ :includes '(<iostream> <typeinfo>) :namespaces std :main no :flags -std=c++17 :results output
template <typename T>
void func1(T param) {
   cout << "Func 1 param : " <<  typeid(param).name() << endl;
}
template <typename T>
void func2(T& param) {
   cout << "Func 2 param : " <<  typeid(param).name() << endl;
}
template <typename T>
void func3(T* param) {

}
template <typename T>
void func4(T&& param) {

}

int  main(){
    int i = 10;
    const int ci = 15;
    const int &cir = ci;
    int * pi = &i;
    const int * cpi = &i;

    func1(i);
    func2(ci);
}

#+end_src

#+RESULTS:
: Func 1 param : i
: Func 2 param : i

*** Tuple
#+begin_quote
Tupple defenition
Class template std::tuple is a fixed-size collection of heterogeneous values. It is a generalization of std::pair.
If std::is_trivially_destructible<Ti>::value is true for every Ti in Types, the destructor of std::tuple is trivial.

#+end_quote

#+begin_src C++  :includes <iostream> <string> <tuple> :flags -std=c++17 :main no :results output
using namespace std;
tuple<double, char,string> get_student(int id ){
    switch (id) {
        case 0: return {3.8, 'A', "Lisa Simpson"};
        case 1: return {2.9, 'C', "Milhouse Van Houten"};
        case 2: return {1.7, 'D', "Ralph Wiggum"};
        case 3: return {0.6, 'F', "Bart Simpson"};
        }
    throw std::invalid_argument("id");
    }

int main()
{
    const auto student0 = get_student(0);
    std::cout << "ID: 0, "
              << "GPA: " << std::get<0>(student0) << ", "
              << "grade: " << std::get<1>(student0) << ", "
              << "name: " << std::get<2>(student0) << '\n';

    const auto student1 = get_student(1);
    std::cout << "ID: 1, "
              << "GPA: " << std::get<double>(student1) << ", "
              << "grade: " << std::get<char>(student1) << ", "
              << "name: " << std::get<std::string>(student1) << '\n';

    double gpa2;
    char grade2;
    string name2;
    tie(gpa2, grade2, name2) = get_student(2);
    cout << "ID: 2, "
              << "GPA: " << gpa2 << ", "
              << "grade: " << grade2 << ", "
              << "name: " << name2 << '\n';

    // C++17 structured binding:
    const auto [gpa3, grade3, name3] = get_student(3);
    cout << "ID: 3, "
              << "GPA: " << gpa3 << ", "
              << "grade: " << grade3 << ", "
              << "name: " << name3 << '\n';
}

#+end_src

#+RESULTS:
: ID: 0, GPA: 3.8, grade: A, name: Lisa Simpson
: ID: 1, GPA: 2.9, grade: C, name: Milhouse Van Houten
: ID: 2, GPA: 1.7, grade: D, name: Ralph Wiggum
: ID: 3, GPA: 0.6, grade: F, name: Bart Simpson

+ exercise example
#+NAME: tuple example
#+begin_src C++ :includes <string> <tuple> <cassert> <iostream> :flags -std=c++20 :results output :main no

using namespace std;
auto getPerson() {
        const string name = "Petia";
        const string secondName = "Ivanoff";
        const size_t age = 23;
        const string department = "Sale";
        return make_tuple(name, secondName, age, department);
}

template<typename... Args,typename Func>
auto custom_tie(Args&&... args,Func func){
    auto result = func();
    auto[name,secondName,age,department] = result;
    tie(args...) = forward<decltype(result)>(result);
}

int main(int argc, char * argv[]) {
        string name, secondName, department;
        size_t age;
        // Call custom_tie to assign values
        custom_tie(name, secondName, age, department) = getPerson();
        cout<< "Name : " << name << " Second  name : " << secondName << "department" << department << endl;

        assert(name == "Petia");
        assert(secondName == "Ivanoff");
        assert(age == 23);
        assert(department == "Sale");
return 0;
}

#+end_src

#+RESULTS: tuple example

*** Weak ptr

#+begin_src C++ :includes '(<iostream> <algorithm> <functional> <cassert>) :main no :flags -std=c++20 :results output
using namespace std;

struct Observer {
  public:
    explicit Observer(int value) : m_value(value) {}

    void notify() { std::cout << "notify: " << m_value << std::endl; }

  private:
    int m_value;
};

struct Observable {
    void registerObserver(const std::shared_ptr<Observer> &observer) {
        m_observers.emplace_back(observer);
    }

    void notify() {
        for (auto &obs : m_observers) {
            auto ptr = obs;
            auto p = ptr.lock();
            if (p)
                p->notify();
        }
    }

  private:
    std::vector<std::weak_ptr<Observer>> m_observers;
};

void observer_test() {
    Observable observable;
    auto obs1 = make_shared<Observer>(1);
    observable.registerObserver(obs1);

    auto obs2 = make_shared<Observer>(2);
    observable.registerObserver(obs2);

    auto obs3 = make_shared<Observer>(3);
    observable.registerObserver(obs3);

    {
        auto obs4 = make_shared<Observer>(4);
        observable.registerObserver(obs4);
    }

    observable.notify();
}

void weak_ptr_example() {
    weak_ptr<int> weak;
    {
        auto shared = make_shared<int>(42);
        weak = shared;
        auto x = weak.lock();
        assert(x);
    }
    auto x = weak.lock();
    assert(!x);
}

int main() {

    weak_ptr_example();
    observer_test();

    return 0;
}

#+end_src

#+RESULTS:
: notify: 1
: notify: 2
: notify: 3

*** Smart ptr

#+begin_src C++ :includes '(<iostream> <algorithm> <functional> <cassert>) :main no :flags -std=c++20 :results output

#include <iostream>

template <typename T>
class smart_ptr {
    T *ptr;

  public:
    smart_ptr(T *ptr_) : ptr{ptr_} {}
    ~smart_ptr() { delete ptr; }
    T *get() { return ptr; }
    T *operator->() { return ptr; }
    T &operator*() { return *ptr; }
};

class A {
  public:
    A() { std::cout << __PRETTY_FUNCTION__ << std::endl; }
    ~A() { std::cout << __PRETTY_FUNCTION__ << std::endl; }
};

void example() {
    smart_ptr<int> ptr(new int{10});
}

template <typename T>
void foo(smart_ptr<T> ptr) {
    std::cout << ptr.get() << std::endl;
}

void double_free() {
    std::cout << __PRETTY_FUNCTION__ << std::endl;
    smart_ptr<A> ptr(new A);
}


void double_free2() {
    std::cout << __PRETTY_FUNCTION__ << std::endl;
    smart_ptr<A> ptr(new A);
    foo(ptr);
}

int main() {

    double_free();
    double_free2();
    return 0;
}
#+end_src

#+RESULTS:
: void double_free()
: A::A()
: A::~A()
: void double_free2()
: A::A()
: 0x600000f30030
: A::~A()
: A::~A()

